app/controllers/account_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT 1  [["username", ""]]
---
  def login
    user = User.find_by_username(login_params[:username])

INSERT INTO "users" ("username", "password_digest", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def register
    @user = User.new(register_params)
    if @user.valid?
      @user.save