app/controllers/contacts_controller.rb

  def index
    if params[:search]
      @contacts = Contact.where(
          'users_id=? AND (first_name like ? OR last_name like ? OR phone_number like ?)',
          @user.id, "%#{params[:search]}%", "%#{params[:search]}%", "%#{params[:search]}%"
      ).paginate(:page => params[:page])
---
SELECT  "contacts".* FROM "contacts" WHERE (users_id=1 AND (first_name like '%Kowalski%' OR last_name like '%Kowalski%' OR phone_number like '%Kowalski%')) LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "contacts" WHERE (users_id=1 AND (first_name like '%%' OR last_name like '%%' OR phone_number like '%%'))

  def create
    @contact = Contact.create(contact_params)
---
INSERT INTO "contacts" ("first_name", "last_name", "phone_number", "users_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["first_name", "Kamil"], ["last_name", "Krampa"], ["phone_number", "516133552"], ["users_id", 1], ["created_at", "2015-04-11 19:42:40.675346"], ["updated_at", "2015-04-11 19:42:40.675346"]]

  def update
    @contact.update(contact_params)
---
UPDATE "contacts" SET "last_name" = ?, "updated_at" = ? WHERE "contacts"."id" = ?  [["last_name", "Kowalski"], ["updated_at", "2015-04-13 05:19:24.849602"], ["id", 5]]